diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ВКМ_Выплаты</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
//НачалоДоработки. Барышникова Ю.А 12.11.2024  

//Выплата з/п
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ОбработчикиСобытий

	Процедура ОбработкаПроведения(Отказ, РежимПроведения)

		// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Для Каждого ТекСтрокаВыплаты Из ВКМ_Выплаты Цикл
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ВКМ_Сотрудник = ТекСтрокаВыплаты.ВКМ_Сотрудник;
			Движение.ВКМ_Сумма = ТекСтрокаВыплаты.ВКМ_Сумма;
		КонецЦикла;      

	КонецПроцедуры

	#КонецОбласти

	#Область СлужебныеПроцедурыИФункции

	Процедура ОчисткаРегистра() Экспорт

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	КонецПроцедуры

	#КонецОбласти

#КонецЕсли

//Конец доработки
